app/views/user/edit.html.erb

     Department:<br>
     <%= select(params[:department_id],"department_id", @department.collect {|p| [ p.department_name, p.id, selected:"#{u.department_id}" ] }, { include_blank: true })%><br>
---
SELECT `departments`.* FROM `departments`