app/controllers/courses_controller.rb

  def index
    if params[:search].present?
      @courses = Course.joins(:studytime).select("courses.*, studytimes.*, courses.id").search(params[:search]).order("courses.created_at DESC")
---
SELECT courses.*, studytimes.*, courses.id FROM `courses` INNER JOIN `studytimes` ON `studytimes`.`id` = `courses`.`studytime_id` ORDER BY courses.created_at DESC