app/controllers/equipment_controller.rb

    def set_equipment
      @equipment = Equipment.find(params[:id])
---
SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1