app/controllers/notices_controller.rb

SELECT `notices`.* FROM `notices` WHERE `notices`.`admin` = 1
---
  def index
    if current_user.admin == 0
      @notices = Notice.where(:admin => 0 )

SELECT `notices`.* FROM `notices` ORDER BY created_at DESC
---
  def notice_common
    @notices = Notice.all.order("created_at DESC")