app/controllers/timetables_controller.rb

SELECT rooms.*,courses.*,timetables.*, users.*,timetables.course_id FROM `timetables` INNER JOIN `rooms` ON `rooms`.`id` = `timetables`.`room_id` INNER JOIN `courses` ON `courses`.`id` = `timetables`.`course_id` INNER JOIN `users` ON `users`.`id` = `timetables`.`user_id` WHERE `timetables`.`user_id` = 2
---
  def teacher_calendar
   @current_day = Time.now.day
   if current_user.present?
     gon.current_user_id = @current_user.id
   end
   @timetables = Timetable.joins(:room, :course, :user).select("rooms.*,courses.*,timetables.*, users.*,timetables.course_id").where(:user_id => current_user.id)

SELECT rooms.*,courses.*,timetables.* FROM `timetables` INNER JOIN `rooms` ON `rooms`.`id` = `timetables`.`room_id` INNER JOIN `courses` ON `courses`.`id` = `timetables`.`course_id` WHERE `timetables`.`user_id` = 2
---
 def teacher_class
   @timetables = Timetable.joins(:room, :course).select("rooms.*,courses.*,timetables.*").where(:user_id => current_user.id)