app/controllers/usercourses_controller.rb

SELECT `usercourses`.* FROM `usercourses` WHERE `usercourses`.`course_id` = 1
---
    def set_usercourse
      @usercourse = Usercourse.find(params[:id])